#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/shuuren/shuuren-alpha/runs/run-CFL7HkAtV5pTqEWX

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_rest_api.shuuren_api_gateway_rest_api: Refreshing state... [id=kvf6m5r20e]
aws_api_gateway_resource.shuuren_api_gateway_resource: Refreshing state... [id=o4nxqh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.shuuren_cert will be created
  + resource "aws_acm_certificate" "shuuren_cert" {
      + arn                       = (known after apply)
      + domain_name               = "shuuren.com"
      + domain_validation_options = [
          + {
              + domain_name           = "shuuren.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "shuuren.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.shuuren_cert_validation will be created
  + resource "aws_acm_certificate_validation" "shuuren_cert_validation" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
    }

  # aws_api_gateway_deployment.shuuren_api_user_get_deployment will be created
  + resource "aws_api_gateway_deployment" "shuuren_api_user_get_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "kvf6m5r20e"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_domain_name.shuuren_api_gateway_custom_domain will be created
  + resource "aws_api_gateway_domain_name" "shuuren_api_gateway_custom_domain" {
      + arn                                    = (known after apply)
      + certificate_arn                        = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "shuuren.com"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = (known after apply)
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_api_gateway_integration.shuuren_api_user_get_integration will be created
  + resource "aws_api_gateway_integration" "shuuren_api_user_get_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = "kvf6m5r20e"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_method.shuuren_api_user_get will be created
  + resource "aws_api_gateway_method" "shuuren_api_user_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kvf6m5r20e"
    }

  # aws_api_gateway_resource.shuuren_api_gateway_resource will be destroyed
  # (because aws_api_gateway_resource.shuuren_api_gateway_resource is not in configuration)
  - resource "aws_api_gateway_resource" "shuuren_api_gateway_resource" {
      - id          = "o4nxqh" -> null
      - parent_id   = "x7no2x9y44" -> null
      - path        = "/api" -> null
      - path_part   = "api" -> null
      - rest_api_id = "kvf6m5r20e" -> null
    }

  # aws_api_gateway_resource.shuuren_api_user will be created
  + resource "aws_api_gateway_resource" "shuuren_api_user" {
      + id          = (known after apply)
      + parent_id   = "x7no2x9y44"
      + path        = (known after apply)
      + path_part   = "user"
      + rest_api_id = "kvf6m5r20e"
    }

  # aws_api_gateway_stage.shuuren_api_user_get_stage will be created
  + resource "aws_api_gateway_stage" "shuuren_api_user_get_stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "kvf6m5r20e"
      + stage_name    = "api"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 8 to add, 0 to change, 1 to destroy.


```
</details>
*Pushed by: @rise-sudo, Action: `pull_request`*